In [2]:
import numpy as np
import pandas as pd
from pandas import read_excel

In [3]:
print(pd.__version__)

1.5.2

In [5]:
array = [1, 3, 5, 4.5, 6, 8]

s1 = pd.Series(array)
s2 = pd.Series([1, 3.4, 5.6, 7, 8.4])
display(s1, s2)

0    1.0
1    3.0
2    5.0
3    4.5
4    6.0
5    8.0
dtype: float64

0    1.0
1    3.4
2    5.6
3    7.0
4    8.4
dtype: float64

In [9]:
order = [5, 6, 7, 8, 9, 10]
num_entries = 3

s1 = pd.Series(array, index=order)
s1

print(s1.iloc[(num_entries-1):])
print(s1.iloc[-3:])
print(s1.iloc[:-3])
print(s1.iloc[:3])

7     5.0
8     4.5
9     6.0
10    8.0
dtype: float64
8     4.5
9     6.0
10    8.0
dtype: float64
5    1.0
6    3.0
7    5.0
dtype: float64
5    1.0
6    3.0
7    5.0
dtype: float64

In [5]:
print(s2)

s2.index = ['A', 'B', 'C', 'D', 'E']
print(s2)

0    1.0
1    3.4
2    5.6
3    7.0
4    8.4
dtype: float64
A    1.0
B    3.4
C    5.6
D    7.0
E    8.4
dtype: float64

In [10]:
n = np.random.randn(5)
my_index = ['A', 'B', 'C', 'D', 'E']

s3 = pd.Series(n, index=my_index)
s3

A    1.384349
B    1.059191
C    1.064555
D    1.094764
E   -1.551382
dtype: float64

In [7]:
s5 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10.5])

print(s5.iloc[8:10:1])
print(s5.iloc[-2:])
print(s5.iloc[:-8])
print(s5.iloc[-10:-8])

8     9.0
9    10.5
dtype: float64
8     9.0
9    10.5
dtype: float64
0    1.0
1    2.0
dtype: float64
0    1.0
1    2.0
dtype: float64

In [8]:
s6 = pd.concat([s1, s5])

display(s6)

5      1.0
6      3.0
7      5.0
8      4.5
9      6.0
10     8.0
0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0
7      8.0
8      9.0
9     10.5
dtype: float64

In [9]:
dictionary = {'A' : 1, 'B' : 2, 'C' : 3, 'D' : 4,'E' : 5}

s4 = pd.Series(dictionary)
s4

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [12]:
columns = ('A', 'B', 'C', 'D')

dates = pd.date_range('20220501', periods=4)

df1 = pd.DataFrame(np.random.randn(4,4), index=dates, columns=columns, dtype='float64')

df1

                   A         B         C         D
2022-05-01  1.610098  0.717731 -0.300520  0.449125
2022-05-02 -0.762810 -0.849782  0.185113 -0.093964
2022-05-03  0.218495  2.133412 -0.444878  0.753597
2022-05-04  0.046049  0.010595  0.641019 -0.245570

In [26]:
df2 = pd.DataFrame(
    {
        "A": [1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0],
        "B": pd.date_range('20130102', periods=10),
        "C": pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], index=list(range(10)), dtype='int64'),
        "D": np.array([3] * 10, dtype='float64'),
        "E": pd.Categorical(['test', 'train', 'test', 'train', 'test', 'train', 'test', 'train', 'test', 'train']),
        "F": ['Aasa', 'S', 'H', 'E', 'S', 'A', 'S', 'H', 'E', 'S'],  
  }
)

display(df2)

      A          B   C    D      E     F
0   1.0 2013-01-02   1  3.0   test  Aasa
1   2.0 2013-01-03   2  3.0  train     S
2   3.0 2013-01-04   3  3.0   test     H
3   4.0 2013-01-05   4  3.0  train     E
4   5.0 2013-01-06   5  3.0   test     S
5   6.0 2013-01-07   6  3.0  train     A
6   7.0 2013-01-08   7  3.0   test     S
7   8.0 2013-01-09   8  3.0  train     H
8   9.0 2013-01-10   9  3.0   test     E
9  10.0 2013-01-11  10  3.0  train     S

In [15]:
df2.drop(9)

     A          B  C    D      E     F
0  1.0 2013-01-02  1  3.0   test  Aasa
1  2.0 2013-01-03  2  3.0  train     S
2  3.0 2013-01-04  3  3.0   test     H
3  4.0 2013-01-05  4  3.0  train     E
4  5.0 2013-01-06  5  3.0   test     S
5  6.0 2013-01-07  6  3.0  train     A
6  7.0 2013-01-08  7  3.0   test     S
7  8.0 2013-01-09  8  3.0  train     H
8  9.0 2013-01-10  9  3.0   test     E

In [16]:
df2 = df2.drop(9)
df2 = df2.drop(8)
df2 = df2.drop(7)
df2 = df2.drop(6)
df2 = df2.drop(5)

display(df2)

     A          B  C    D      E     F
0  1.0 2013-01-02  1  3.0   test  Aasa
1  2.0 2013-01-03  2  3.0  train     S
2  3.0 2013-01-04  3  3.0   test     H
3  4.0 2013-01-05  4  3.0  train     E
4  5.0 2013-01-06  5  3.0   test     S

In [14]:
arr1 = [1, 2, 3, 4, 5, 6]
arr2 = [1.5, 2.5, 3.5, 4.5, 5.5]

s7 = pd.Series(arr1)
print(s7)

s8 = pd.Series(arr2)
print(s8)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
0    1.5
1    2.5
2    3.5
3    4.5
4    5.5
dtype: float64

In [15]:
s8.add(s7)

0     2.5
1     4.5
2     6.5
3     8.5
4    10.5
5     NaN
dtype: float64

In [16]:
s8.sub(s7)

0    0.5
1    0.5
2    0.5
3    0.5
4    0.5
5    NaN
dtype: float64

In [17]:
s7.mul(s8)

0     1.5
1     5.0
2    10.5
3    18.0
4    27.5
5     NaN
dtype: float64

In [18]:
s8.div(s7)

0    1.500000
1    1.250000
2    1.166667
3    1.125000
4    1.100000
5         NaN
dtype: float64

In [19]:
s1 = s7.mul(s8)
print(s1)

print('Max value:', s1.max())
print('Mean value:', s1.mean())
print('Min value:', s1.min())

0     1.5
1     5.0
2    10.5
3    18.0
4    27.5
5     NaN
dtype: float64
Max value: 27.5
Mean value: 12.5
Min value: 1.5

In [17]:
time = pd.date_range('today', periods=6)
print(time)

DatetimeIndex(['2023-01-15 15:08:51.684871', '2023-01-16 15:08:51.684871',
               '2023-01-17 15:08:51.684871', '2023-01-18 15:08:51.684871',
               '2023-01-19 15:08:51.684871', '2023-01-20 15:08:51.684871'],
              dtype='datetime64[ns]', freq='D')

In [18]:
columns = ('A', 'B', 'C', 'D')

num_arr = np.random.randn(6,4)

df3 = pd.DataFrame(num_arr, index=time, columns=columns)
df3

                                   A         B         C         D
2023-01-15 15:08:51.684871  0.034506  0.202821  1.351624  1.796053
2023-01-16 15:08:51.684871  1.564561 -0.416934 -1.218325 -0.167261
2023-01-17 15:08:51.684871  1.095255 -0.911524  0.067084 -1.686344
2023-01-18 15:08:51.684871 -1.188896 -1.096360 -1.017631  0.934377
2023-01-19 15:08:51.684871  0.349045 -0.201408 -1.248881 -0.432896
2023-01-20 15:08:51.684871 -0.180990 -1.191835 -1.398678 -1.020065

In [28]:
data = {
    'Animal': ['cat', 'dog', 'snake', 'monkey', 'bird', 'elephant', 'lion', 'rabbit', 'fox', 'wolf'],
    'Age': [2.5, 3, 0.5, np.nan, 1.7, 7, 4.5, np.nan, 2, 5],
    'Visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'Priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no'],  
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df2 = pd.DataFrame(data, index=labels)
display(df2)

     Animal  Age  Visits Priority
a       cat  2.5       1      yes
b       dog  3.0       3      yes
c     snake  0.5       2       no
d    monkey  NaN       3      yes
e      bird  1.7       2       no
f  elephant  7.0       3       no
g      lion  4.5       1       no
h    rabbit  NaN       1      yes
i       fox  2.0       2       no
j      wolf  5.0       1       no

In [29]:
print(df2.dtypes)

Animal       object
Age         float64
Visits        int64
Priority     object
dtype: object

In [30]:
print(df2.head(2))

  Animal  Age  Visits Priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes

In [31]:
print(df2.tail(2))

  Animal  Age  Visits Priority
i    fox  2.0       2       no
j   wolf  5.0       1       no

In [32]:
df3 = df2.head(3)
display(df3)

  Animal  Age  Visits Priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no

In [33]:
df4 = df2.tail(3)
display(df4)

   Animal  Age  Visits Priority
h  rabbit  NaN       1      yes
i     fox  2.0       2       no
j    wolf  5.0       1       no

In [33]:
df5 = pd.concat([df3, df4])
df5

     A          B  C    D      E     F
0  1.0 2013-01-02  1  3.0   test  Aasa
1  2.0 2013-01-03  2  3.0  train     S
2  3.0 2013-01-04  3  3.0   test     H
2  3.0 2013-01-04  3  3.0   test     H
3  4.0 2013-01-05  4  3.0  train     E
4  5.0 2013-01-06  5  3.0   test     S

In [34]:
# Index are the lines
print(df2.index)

# Printing the columns
print(df2.columns)

# The values of each os these columns and indexes
print(df2.values)

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')
Index(['Animal', 'Age', 'Visits', 'Priority'], dtype='object')
[['cat' 2.5 1 'yes']
 ['dog' 3.0 3 'yes']
 ['snake' 0.5 2 'no']
 ['monkey' nan 3 'yes']
 ['bird' 1.7 2 'no']
 ['elephant' 7.0 3 'no']
 ['lion' 4.5 1 'no']
 ['rabbit' nan 1 'yes']
 ['fox' 2.0 2 'no']
 ['wolf' 5.0 1 'no']]

In [35]:
df3.describe()

            Age  Visits
count  3.000000     3.0
mean   2.000000     2.0
std    1.322876     1.0
min    0.500000     1.0
25%    1.500000     1.5
50%    2.500000     2.0
75%    2.750000     2.5
max    3.000000     3.0

In [36]:
df3 = df2.T
df3

            a    b      c       d     e         f     g       h    i     j
Animal    cat  dog  snake  monkey  bird  elephant  lion  rabbit  fox  wolf
Age       2.5  3.0    0.5     NaN   1.7       7.0   4.5     NaN  2.0   5.0
Visits      1    3      2       3     2         3     1       1    2     1
Priority  yes  yes     no     yes    no        no    no     yes   no    no

In [41]:
df = df2.sort_values(by=['Age'], ascending=True)
df

     Animal  Age  Visits Priority
c     snake  0.5       2       no
e      bird  1.7       2       no
i       fox  2.0       2       no
a       cat  2.5       1      yes
b       dog  3.0       3      yes
g      lion  4.5       1       no
j      wolf  5.0       1       no
f  elephant  7.0       3       no
d    monkey  NaN       3      yes
h    rabbit  NaN       1      yes

In [42]:
display(df2.iloc[2:-4])

     Animal  Age  Visits Priority
c     snake  0.5       2       no
d    monkey  NaN       3      yes
e      bird  1.7       2       no
f  elephant  7.0       3       no

In [43]:
df1 = df2[['Age', 'Visits']]
df2 = df1.sort_values(by=['Age'], ascending=False)
df2

   Age  Visits
f  7.0       3
j  5.0       1
g  4.5       1
b  3.0       3
a  2.5       1
i  2.0       2
e  1.7       2
c  0.5       2
d  NaN       3
h  NaN       1

In [44]:
df10 = df2.copy()
df10

   Age  Visits
f  7.0       3
j  5.0       1
g  4.5       1
b  3.0       3
a  2.5       1
i  2.0       2
e  1.7       2
c  0.5       2
d  NaN       3
h  NaN       1

In [45]:
df10.loc['e', 'Age'] = 0
df10

   Age  Visits
f  7.0       3
j  5.0       1
g  4.5       1
b  3.0       3
a  2.5       1
i  2.0       2
e  0.0       2
c  0.5       2
d  NaN       3
h  NaN       1

In [59]:
print(df10.isnull())

     Age  Visits
f  False   False
j  False   False
g  False   False
b  False   False
a  False   False
i  False   False
e  False   False
c  False   False
d   True   False
h   True   False

In [48]:
print(df10.mean(axis=0, numeric_only=True, skipna=True))

Age       3.0625
Visits    1.9000
dtype: float64

In [52]:
print(df10['Visits'].sum(axis=0, numeric_only=True, skipna=True))
print(df10['Age'].mean(axis=0, numeric_only=True, skipna=True))

19
3.0625